# Summer Olympics Data Analysis Assignment

In [57]:
import pandas as pd

In [58]:
df=pd.read_csv("summer.csv")

In [59]:
df.head()

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold
1,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver
2,1896,Athens,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100M Freestyle For Sailors,Bronze
3,1896,Athens,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100M Freestyle For Sailors,Gold
4,1896,Athens,Aquatics,Swimming,"CHASAPIS, Spiridon",GRE,Men,100M Freestyle For Sailors,Silver

### 1. In how many cities Summer Olympics is held so far?

In [60]:

len(df['City'].unique())

22

### 2. Which sport is having most number of Gold Medals so far? (Top 5)

In [68]:
df1=df[df['Medal']=='Gold']
data=[]
for i in df1['Sport'].unique():
    data.append([i,len(df1[df1['Sport']==i])])
data=pd.DataFrame(data,columns=['Sport','Number Of Gold Medal'])
data.sort_values(by="Number Of Gold Medal",ascending=False ).head()

         Sport  Number Of Gold Medal
0     Aquatics                  1421
1    Athletics                  1215
17      Rowing                   890
4   Gymnastics                   820
3      Fencing                   552

### 3. Which sport is having most number of medals so far? (Top 5)

In [62]:
Smedal=[]
for j in df['Sport'].unique():
    Smedal.append([j,len(df[df['Sport']==j])])

Smedal=pd.DataFrame(Smedal,columns=['Sport','Number Of Medal'])
Smedal.sort_values(by="Number Of Medal",ascending=False ).head()

         Sport  Number Of Medal
0     Aquatics             4170
1    Athletics             3638
17      Rowing             2667
4   Gymnastics             2307
3      Fencing             1613

### 4. Which player has won most number of medals? (Top 5)

In [63]:
Pmedal=[]
for k in df['Athlete'].unique():
    Pmedal.append([k,len(df[df['Athlete']==k])])

Pmedal=pd.DataFrame(Pmedal,columns=['Athlete','Number Of Medal'])
Pmedal.sort_values(by="Number Of Medal",ascending=False ).head()

                    Athlete  Number Of Medal
18640       PHELPS, Michael               22
7197       LATYNINA, Larisa               18
9948     ANDRIANOV, Nikolay               15
6591           ONO, Takashi               13
5103   MANGIAROTTI, Edoardo               13

### 5. Which player has won most number Gold Medals of medals? (Top 5)

In [64]:
Pgold=[]
for l in df1['Athlete'].unique():
    Pgold.append([l,len(df1[df1['Athlete']==l])])
Pgold=pd.DataFrame(Pgold,columns=['Athlete','Number Of Gold Medal'])
Pgold.sort_values(by="Number Of Gold Medal",ascending=False ).head()

               Athlete  Number Of Gold Medal
6851   PHELPS, Michael                    18
3320       SPITZ, Mark                     9
2714  LATYNINA, Larisa                     9
4630       LEWIS, Carl                     9
907       NURMI, Paavo                     9

### 6. In which year India won first Gold Medal in Summer Olympics?

In [65]:
df1[df1['Country']=='IND'].sort_values(by="Year",ascending=True)["Year"].head(1)

5512    1928
Name: Year, dtype: int64

### 7. Which event is most popular in terms on number of players? (Top 5)

In [66]:
Pop=[]
for l in df['Event'].unique():
    Pop.append([l,len(df[df['Event']==l])])
Pop=pd.DataFrame(Pop,columns=['Event','Number Players'])
Pop.sort_values(by="Number Players",ascending=False ).head()

                Event  Number Players
80           Football            1497
176            Hockey            1422
138  Team Competition            1147
327        Basketball            1012
337          Handball             973

### 8. Which sport is having most female Gold Medalists? (Top 5)

In [67]:
df2=df1[df1["Gender"]=="Women"]
Fgold=[]
for l in df2['Sport'].unique():
    Fgold.append([l,len(df2[df2['Sport']==l])])
Fgold=pd.DataFrame(Fgold,columns=['Sport','Number Of Female'])
Fgold.sort_values(by="Number Of Female",ascending=False ).head()

         Sport  Number Of Female
4     Aquatics               589
7    Athletics               389
8   Gymnastics               268
14      Rowing               217
11  Volleyball               166